tutorials/legacy/incompressible/icoFoam/cavity/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (-5 -5 -0.5)
    (5 -5 -0.5)
    (5 5 -0.5)
    (-5 5 -0.5)
    (-5 -5 0.5)
    (5 -5 0.5)
    (5 5 0.5)
    (-5 5 0.5)
    (0 -2 -0.7)
    (2 0 -0.7)
    (0 2 -0.7)
    (-2 0 -0.7)
    (0 -2 0.7)
    (2 0 0.7)
    (0 2 0.7)
    (-2 0 0.7)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 100 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (10 10 1) simpleGrading (1 1 1)
);

edges
(
    arc 8 9 90 (0 0 1)
    arc 9 10 90 (0 0 1)
    arc 10 11 90 (0 0 1)
    arc 11 8 90 (0 0 1)
    arc 12 13 90 (0 0 1)
    arc 13 14 90 (0 0 1)
    arc 14 15 90 (0 0 1)
    arc 15 12 90 (0 0 1)
);

boundary
(
    obstacleFixedWalls
    {
        type wall;
        faces
        (
            (8 12 15 11)
            (11 15 14 10)
            (10 14 13 9)
            (9 13 12 8)
        );
    }
    obstacleFrontAndBack
    {
        type empty;
        faces
        (
            (8 11 10 9)
            (12 13 14 15)
        );
    }
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
